
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	&ВидДвижения КАК ВидДвижения,
	               |	ПоступлениеТовараТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ПоступлениеТовараТовары.Количество) КАК Остаток
	               |ИЗ
	               |	Документ.ПоступлениеТовара.Товары КАК ПоступлениеТовараТовары
	               |ГДЕ
	               |	ПоступлениеТовараТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТовараТовары.Номенклатура";
	Запрос.Параметры.Вставить("Период",Дата);
	Запрос.Параметры.Вставить("Ссылка",Ссылка);
	Запрос.Параметры.Вставить("ВидДвижения",ВидДвиженияНакопления.Приход);
	РезультатЗапроса = Запрос.Выполнить();
	
	Движения.ОстаткиТоваров.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
