
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	Для каждого СтрокаТовары из Товары Цикл
		
		НС = Движения.ОстаткиТоваров.ДобавитьРасход();
		НС.Период = Дата;
		НС.Номенклатура = СтрокаТовары.Номенклатура;
		НС.Остаток = СтрокаТовары.Количество;
		
		НСП = Движения.Продажи.Добавить();
		НСП.Период = Дата;
		НСП.Номенклатура = СтрокаТовары.Номенклатура;
		НСП.Количество = СтрокаТовары.Количество;
		НСП.Сумма = СтрокаТовары.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры
