
&НаСервереБезКонтекста
Функция ПолучитьЦену(КонтрагентСсылка, НоменклатураСсылка, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	1 КАК Приоритет,
	               |	ЦеныНоменклатурыСрезПоследних.ЦенаПродажи КАК ЦенаПродажи
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&Период,
	               |			Контрагент = &Контрагент
	               |				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	2,
	               |	ЦеныНоменклатурыСрезПоследних.ЦенаПродажи
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&Период,
	               |			Контрагент = &ПустойКонтрагент
	               |				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет";
	Запрос.Параметры.Вставить("Период",Дата);
	Запрос.Параметры.Вставить("Контрагент",КонтрагентСсылка);
	Запрос.Параметры.Вставить("Номенклатура",НоменклатураСсылка);
	Запрос.Параметры.Вставить("ПустойКонтрагент",Справочники.Контрагенты.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ЦенаПродажи;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьСтроку(_Строка)
	_Строка.Сумма = _Строка.Количество * _Строка.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	// цена уже установлена?
	Если Элементы.Товары.ТекущиеДанные.Цена = 0 Тогда
		Элементы.Товары.ТекущиеДанные.Цена = ПолучитьЦену(Объект.Контрагент, Элементы.Товары.ТекущиеДанные.Номенклатура, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСтроку(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентДатаПриИзменении(Элемент)
	
	// нас не просили, но сделаем
	Для каждого СтрокаТовар из Объект.Товары Цикл
		СтрокаТовар.Цена = ПолучитьЦену(Объект.Контрагент, СтрокаТовар.Номенклатура, Объект.Дата);
		ПересчитатьСтроку(СтрокаТовар);
	КонецЦикла;
	
	// сам знаю, что не красиво. Нужно бы спросить у пользователя, хочет ли он поменять контрагента так как цены поменяются.
	// но уже поздно, а по стандартам окна с вопросами - это столько писанины... Обычно мы все копипастим из типовушек
	
КонецПроцедуры
