
&НаКлиенте
Процедура ПересчитатьСтроку(_Строка)
	_Строка.Сумма = _Строка.Количество * _Строка.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	// цена уже установлена?
	Если Элементы.Товары.ТекущиеДанные.Цена = 0 Тогда
		Элементы.Товары.ТекущиеДанные.Цена = СлужебныеФункции.ПолучитьЦену(Объект.Контрагент, Элементы.Товары.ТекущиеДанные.Номенклатура, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСтроку(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентДатаПриИзменении(Элемент)
	
	// нас не просили, но сделаем
	Для каждого СтрокаТовар из Объект.Товары Цикл
		СтрокаТовар.Цена = СлужебныеФункции.ПолучитьЦену(Объект.Контрагент, СтрокаТовар.Номенклатура, Объект.Дата);
		ПересчитатьСтроку(СтрокаТовар);
	КонецЦикла;
	
	// сам знаю, что не красиво. Нужно бы спросить у пользователя, хочет ли он поменять контрагента так как цены поменяются.
	// но уже поздно, а по стандартам окна с вопросами - это столько писанины... Обычно мы все копипастим из типовушек
	
КонецПроцедуры
