#language: ru

@tree
@черновик

Функционал: Установка цен продажи номенклатуры

Как Менеджер по продажам 

Я хочу устанавливать цену продажи номенклатуры любому Клиенту

Я хочу устанавливать цену продажи номенклатуры по компании в целом

Я хочу формировать отчет, показывающий цену продажи номенклатуры в разрезе клиентов и товаров по указанному мной периоду
с возможностью указывать отбор по клиенту или товару

Контекст:
    Дано я открыл клиент тестирования от имени "Менеджер по продажам"
    И в списке номенклатуры имеются 10 номенклатур 'Номенклатура 01' ... 'Номенклатура 10'
    И в списке клиентов имеются 10 клиентов 'Клиент 01' ... 'Клиент 10'