&НаСервере
Функция ПолучитьЦену(КонтрагентСсылка, НоменклатураСсылка, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	1 КАК Приоритет,
	               |	ЦеныНоменклатурыСрезПоследних.ЦенаПродажи КАК ЦенаПродажи
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&Период,
	               |			Контрагент = &Контрагент
	               |				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	2,
	               |	ЦеныНоменклатурыСрезПоследних.ЦенаПродажи
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&Период,
	               |			Контрагент = &ПустойКонтрагент
	               |				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет";
	Запрос.Параметры.Вставить("Период",Дата);
	Запрос.Параметры.Вставить("Контрагент",КонтрагентСсылка);
	Запрос.Параметры.Вставить("Номенклатура",НоменклатураСсылка);
	Запрос.Параметры.Вставить("ПустойКонтрагент",Справочники.Контрагенты.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ЦенаПродажи;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

